error_name_dialog = Error
not_valid_climate = Este clima no existe
passwords_not_equal = La contrase\u00f1a y la contrase\u00f1a repetida son diferentes
wrong_password = la contrase\u00f1a es incorrecta
login_not_exist = Este inicio de sesi\u00f3n no existe
login_exist = Este inicio de sesi\u00f3n ya est\u00e1 en uso
uni = Algo sali\u00f3 mal con el servidor
connection_is_closed = Error al conectar con el servidor.
server_is_unavailable = El servidor no est\u00e1 disponible
create_connect_failed = Ha fallado la creaci\u00f3n de la conexi\u00f3n
strange_request = Se recibi\u00f3 una solicitud extra\u00f1a del servidor
configuration_data_loading_failed = Error al cargar los datos de configuraci\u00f3n
net_channel_failed = El canal de red no estaba abierto
clearing_data_failed = Error con la eliminaci\u00f3n de datos en la base de datos
remove_data_failed = Error con la eliminaci\u00f3n de datos en la base de datos
not_unique_id = La identificaci\u00f3n de esta ciudad existe en la colecci\u00f3n.
id_not_exist = Esta identificaci\u00f3n no existe
not_owner = No eres due\u00f1o de este objeto
update_failed = Error al actualizar datos en la base de datos
configuration_file_not_found = No se encontr\u00f3 el archivo de configuraci\u00f3n config.excalibbur
port_not_found = No se encontr\u00f3 el puerto en el archivo de configuraci\u00f3n
address_not_found = No se encontr\u00f3 la direcci\u00f3n en el archivo de configuraci\u00f3n
id_is_integer = El ID debe ser un n\u00famero entero
id_is_greater_zero = El ID debe ser mayor que 0
id_not_null = El ID es un campo obligatorio
name_not_empty = El nombre es un campo obligatorio
x_is_float = La coordenada x debe ser un valor flotante
x_check = La coordenada x debe ser mayor que -407
y_is_not_null = La coordenada y es un campo obligatorio
y_is_integer = La coordenada y debe ser un n\u00famero entero
creation_date_not_null = La fecha de creaci\u00f3n es obligatoria
area_is_integer = El \u00e1rea debe ser un n\u00famero entero
area_greater_than_zero = El \u00e1rea debe ser mayor que 0
population_greater_than_zero = La poblaci\u00f3n debe ser mayor que 0
population_is_integer = La poblaci\u00f3n debe ser un n\u00famero entero
meters_above_sea_level_integer = Los metros sobre el nivel del mar deben ser enteros
incorrect_establishment_date = La fecha de establecimiento es incorrecta. Introd\u00facelo como ejemplo: 26/05/22
incorrect_birthday = La fecha de cumplea\u00f1os es incorrecta. Introd\u00facelo como ejemplo: 26/05/22 13:37 PM
age_is_integer = La edad del gobernador es un n\u00famero entero
incorrect_path = La ruta es un campo obligatorio
script_file_not_found = No se encuentra el archivo de script
unknown_commands = Estos comandos eran desconocidos y no se ejecutaron: